Revit 2027 API
ParameterTypeId.FabricationPartDiameterIn Property
 "Main Primary Diameter"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId FabricationPartDiameterIn { get; }
Public Shared ReadOnly Property FabricationPartDiameterIn As ForgeTypeId
	Get
public:
static property ForgeTypeId^ FabricationPartDiameterIn {
	ForgeTypeId^ get ();
}
static member FabricationPartDiameterIn : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace